brew "neovim"
brew "git"
brew "git-delta"
brew "fd"
brew "fzf"
brew "ripgrep"
brew "lazygit"
brew "tree-sitter-cli"
brew "node"
brew "python@3.13"
brew "go"
brew "php"
brew "helm"
brew "tflint"
brew "terraform-docs"
