# Core editor requirements
brew "neovim"
brew "git"
brew "git-delta"
brew "fd"
brew "fzf"
brew "ripgrep"
brew "lazygit"
brew "tree-sitter-cli"

# Languages and runtimes
brew "node"
brew "python@3.13"
brew "go"
brew "php"

# Platform and infrastructure tooling
brew "argocd"
brew "gh"
brew "glab"
brew "helm"
brew "jq"
brew "kubernetes-cli"
brew "terraform-docs"
brew "tfenv"
brew "tilt"
brew "yq"
cask "gcloud-cli"

# Shell and workstation utilities
brew "tmux"
brew "tree"
cask "font-jetbrains-mono-nerd-font"

# Additional direct installs currently tracked from this machine
brew "cmatrix"
brew "dnsmasq"
brew "lolcat"
brew "mysql@8.4"
brew "tree-sitter@0.25"
brew "vim"
